Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 Input_BAD (BADBlock)        (None, 1000)              110000    
                                                                 
 output (Dense)              (None, 30)                30030     
                                                                 
=================================================================
Total params: 140,030
Trainable params: 138,030
Non-trainable params: 2,000
_________________________________________________________________
